{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋 I'm Ezgi Coban. I am a Software Developer and currently a student at Code Fellows working on developing and sharpening my skills. My educational background is in Psychology from the University of Washington. I am passionate about mental health awareness and believe that techonology can play a big role in creating solutions to accesibility and lack of information. I also have a background in Customer Service which has given me the skills to succesfully understand, anticipate and satisfy customer needs. I enjoy taking initiative and work on my own as well as collaborate in a team environment. I am proficient in problem solving with attention to detail. My biggest passion is providing my daughter with the best life possible and to have a career that I love to support me in this goal. 💜",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "WDYWE?",
        "startDate": "2022",
        "description": "This was my final project for Code Fellows Code 201 class. I had the opportunity to work with great team members and improved my skills in collaboration. I have learned to use a project management tool to organize the project and put my coding skills to use that I developed during the class including JavaScript objects, DOM Manipulation and Local Storage. The application recommends restaurant options in the Seattle area based on preferences of the user having a difficult time deciding what to eat.",
        "images": [
          "images/portfolio/WDYWE/1.png",
          "images/portfolio/WDYWE/2.png",
          "images/portfolio/WDYWE/3.png"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "name": "HTML 5",
            "class": "devicon-html5-plain"
          },
          {
            "name": "CSS 3",
            "class": "devicon-css3-plain"
          }
        ]
      },
      {
        "title": "Odd Duck Products",
        "startDate": "2022",
        "description": "This application randomizes product images and displays them on the page for users to vote for their favorites. After 25 rounds of voting, the user is able to view the results to see how many times the products were selected and how many times they were displayed. During this project I utilized my skills in JavaScript Objects, Local Storage and learned to create a Chart.",
        "images": [
          "images/portfolio/OddDuck/4.png",
          "images/portfolio/OddDuck/5.png"
        ],
        "url": "https://ezgi-c.github.io/odd-duck/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "name": "HTML 5",
            "class": "devicon-html5-plain"
          },
          {
            "name": "CSS 3",
            "class": "devicon-css3-plain"
          }
        ]
      },
      {
        "title": "Salmon Cookies",
        "startDate": "2022",
        "description": "This is the first project I completed after learning about JavaScript objects and Forms in my Code 201 class. The main page is informational about the fictional Salmon Cookies company, and the sales page contains a table with sales data for multiple locations, as well as a form which makes it possible to add more locations and data. I espically enjoyed working with CSS to style my application.",
        "images": [
          "images/portfolio/SalmonCookies/6.png",
          "images/portfolio/SalmonCookies/7.png"
        ],
        "url": "https://ezgi-c.github.io/cookie-stand/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "name": "HTML 5",
            "class": "devicon-html5-plain"
          },
          {
            "name": "CSS 3",
            "class": "devicon-css3-plain"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "DefOpenSource",
        "title": "Front-End Developer",
        "years": "10.2019 - present",
        "mainTech": [
          "Angular 8/9/10"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "EF Core",
          ".NET Core",
          "SignalR",
          "Angular Material"
        ]
      },
      {
        "company": "Serros Solutions",
        "title": "Intern",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt"
        ]
      }
    ]
  }
